codeigniter/app/Controllers/Auth.php

       $email = $this->request->getPost('email');
         $password = $this->request->getPost('password');
            $userModel = new \App\Models\UsersModel();
            $user_info = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'seher@gmail.com'
 LIMIT 1