app/Controllers/Bilet.php

SELECT *
FROM `terminaller`
WHERE `terminaller`.`terminalID` = '1'
SELECT *
FROM `terminaller`
WHERE `terminaller`.`terminalID` = '2'
---
        public function biletBul()
        {
            $tripID = $this->request->getPost('tripID'); // Seçilen seyahatin ID'sini al


            // Trip ID ile seyahat detaylarını çek
            $seyahatModel = new SeyahatModel();
            $selected_trip = $seyahatModel->find($tripID);

            // Seyahatin ayrıntılarını almak için terminal modellerini kullan
            $departureTerminalModel = new TerminallerModel();
            $arrivalTerminalModel = new TerminallerModel();

            // Seyahatin kalkış terminalini al
            $departureTerminal = $departureTerminalModel->find($selected_trip['departureTerminalID']);

            // Seyahatin varış terminalini al
            $arrivalTerminal = $arrivalTerminalModel->find($selected_trip['arrivalTerminalID']);

SELECT `tripID`, `tripType`, `departureTime`, `arrivalTime`, `departure`.`city` AS `departureCity`, `arrival`.`city` AS `arrivalCity`, `departure`.`terminalName` AS `departureTerminal`, `arrival`.`terminalName` AS `arrivalTerminal`, `busCompanyID`, `busPlate`
FROM `seyahatlertablosu`
JOIN `terminaller` AS `departure` ON `departure`.`terminalID` = `seyahatlertablosu`.`departureTerminalID`
JOIN `terminaller` AS `arrival` ON `arrival`.`terminalID` = `seyahatlertablosu`.`arrivalTerminalID`
WHERE `departure`.`city` = 'İstanbul '
AND `arrival`.`city` = 'İzmir'
AND DATE(departureTime) = '2024-03-06'
AND `tripType` IN ('OneWay')
---
    public function biletAra()
    {
        $model = new SeyahatModel();
        $inputFrom = $this->request->getPost('inputFrom');
        $inputTo = $this->request->getPost('inputTo');
        $inputDate = $this->request->getPost('inputDate');
        $inputStatus = $this->request->getPost('inputStatus');

        $db = \Config\Database::connect();

        $seyahatler = $model->table('seyahatlertablosu')
            ->select('tripID, tripType, departureTime, arrivalTime, departure.city AS departureCity, arrival.city AS arrivalCity, departure.terminalName AS departureTerminal, arrival.terminalName AS arrivalTerminal, busCompanyID, busPlate')
            ->join('terminaller AS departure', 'departure.terminalID = seyahatlertablosu.departureTerminalID')
            ->join('terminaller AS arrival', 'arrival.terminalID = seyahatlertablosu.arrivalTerminalID')
            ->where('departure.city', $inputFrom)
            ->where('arrival.city', $inputTo)
            ->where('DATE(departureTime)', $inputDate)
            ->whereIn('tripType', [$inputStatus])
            ->findAll();